In [157]:
#Standard imports

import pandas as pd
import numpy as np

In [158]:
#Refernce paths for data files

file1 = '/Users/gta/dev/hw-4/schools_complete.csv'
file2 = '/Users/gta/dev/hw-4/students_complete.csv'

In [159]:
#Read in csv file into two dataframes

df_schools = pd.read_csv(file1)
df_students = pd.read_csv(file2)

In [160]:
#Display head of df_schools

df_schools.head()

   School ID                   name      type  size   budget
0          0      Huang High School  District  2917  1910635
1          1   Figueroa High School  District  2949  1884411
2          2    Shelton High School   Charter  1761  1056600
3          3  Hernandez High School  District  4635  3022020
4          4    Griffin High School   Charter  1468   917500

In [161]:
#Display shape of df_schools

df_schools.shape

(15, 5)

In [162]:
#Review summary stats for the data set

df_schools.describe()

       School ID         size        budget
count  15.000000    15.000000  1.500000e+01
mean    7.000000  2611.333333  1.643295e+06
std     4.472136  1420.915282  9.347763e+05
min     0.000000   427.000000  2.480870e+05
25%     3.500000  1698.000000  1.046265e+06
50%     7.000000  2283.000000  1.319574e+06
75%    10.500000  3474.000000  2.228999e+06
max    14.000000  4976.000000  3.124928e+06

In [163]:
#Display head of df_students

df_students.head()

,Student ID,name,gender,grade,school,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84

In [164]:
#Define functions that determine if the student received a passing score

def passing_reading(c):
    if c['reading_score'] > 69:
        return 1
    else:
        return 0

def passing_math(c):
    if c['math_score'] > 69:
        return 1
    else:
        return 0

In [165]:
#Apply functions to create new columns in dataframe 

df_students['passing_reading'] = df_students.apply(passing_reading, axis = 1) 
df_students['passing_math'] = df_students.apply(passing_math, axis=1)
df_students.head()

,Student ID,name,gender,grade,school,reading_score,math_score,passing_reading,passing_math
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,1
1,1,Victor Smith,M,12th,Huang High School,94,61,1,0
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,1,0
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58,0,0
4,4,Bonnie Ray,F,9th,Huang High School,97,84,1,1

In [166]:
#Display shape of df_students

df_students.shape

(39170, 9)

In [167]:
#Review column names in dataframe

df_students.columns

Index(['Student ID', 'name', 'gender', 'grade', 'school', 'reading_score',
       'math_score', 'passing_reading', 'passing_math'],
      dtype='object')

In [168]:
#Review summary stats for the data set

df_students.describe()

,Student ID,reading_score,math_score,passing_reading,passing_math
count,39170.000000,39170.00000,39170.000000,39170.000000,39170.000000
mean,19584.500000,81.87784,78.985371,0.858055,0.749809
std,11307.549359,10.23958,12.309968,0.348999,0.433129
min,0.000000,63.00000,55.000000,0.000000,0.000000
25%,9792.250000,73.00000,69.000000,1.000000,0.000000
50%,19584.500000,82.00000,79.000000,1.000000,1.000000
75%,29376.750000,91.00000,89.000000,1.000000,1.000000
max,39169.000000,99.00000,99.000000,1.000000,1.000000

### District Summary Data Frame Approach (Deliverable 1)


Create a high level snapshot (in table form) of the district's key metrics, including:

+ ~~Total Schools~~
+ ~~Total Students~~
+ ~~Total Budget~~
+ ~~Average Math Score~~
+ ~~Average Reading Score~~
+ ~~% Passing Math~~
+ ~~% Passing Reading~~
+ ~~Overall Passing Rate (Average of the above two)~~

In [169]:
#Calculate total number of schools

total_schools = len(df_schools['name'])
total_schools

15

In [170]:
#Calculate total number of students

total_students = sum(df_schools['size'])
total_students

39170

In [171]:
#Calculate total budget

total_budget = sum(df_schools['budget'])
total_budget

24649428

In [172]:
#Calculate average math score

average_math_score = df_students['math_score'].mean()
average_math_score

78.98537145774827

In [173]:
#Calculate average reading score

average_reading_score = df_students['reading_score'].mean()
average_reading_score

81.87784018381414

In [174]:
#Determine number of students with a passing math score (assume that a passing math score is >69)

total_students_with_passing_math_score = len(df_students.loc[df_students['math_score'] > 69])
total_students_with_passing_math_score

29370

In [175]:
#Determine percent of students with a passing math score (assume that a passing math score is >69)

pct_passing_math_score = 100 * (total_students_with_passing_math_score / total_students)
pct_passing_math_score

74.980852693387803

In [176]:
#Determine number of students with a passing reading score (assume that a passing reading score is >69)

total_students_with_passing_reading_score = len(df_students.loc[df_students['reading_score'] > 69])
total_students_with_passing_reading_score

33610

In [177]:
#Determine percent of students with a passing reading score (assume that a passing reading score is >69)

pct_passing_reading_score = 100 * (total_students_with_passing_reading_score / total_students)
pct_passing_reading_score

85.805463364820014

In [178]:
#Determine overall percentage of students who received a passing score (assume passing score is > 69)

overall_pct_passing = (pct_passing_math_score + pct_passing_reading_score) / 2
overall_pct_passing

80.393158029103915

### District Summary Data Frame (Deliverable 1)

In [179]:
#Take calculated values and send them to a dataframe

summary_df1 = pd.DataFrame([{   'Total Schools':total_schools,
                                'Total Students':total_students,
                                'Total Budget': total_budget,
                                'Average Math Score': average_math_score,
                                'Average Reading Score': average_reading_score,
                                '% Passing Math': pct_passing_math_score,
                                '% Passing Reading': pct_passing_reading_score,
                                '% Overall Passing Rate': overall_pct_passing
                            
                           }])
summary_df1

,% Overall Passing Rate,% Passing Math,% Passing Reading,Average Math Score,Average Reading Score,Total Budget,Total Schools,Total Students
0,80.393158,74.980853,85.805463,78.985371,81.87784,24649428,15,39170

### School Summary

Create an overview table that summarizes key metrics about each school, including:

+ School Name
+ School Type
+ Total Students
+ Total School Budget
+ Per School Budget
+ Average Math Score
+ Average Reading Score
+ % Passing Math
+ % Passing Reading
+ Overall Passing Rate (Average of the above two)

In [180]:
#In order to do an inner join, there must be a common key in both datasets.  Base the common key off of the school name.

df_students1 = df_students.rename(columns={'school':'school_name'})
df_students1.head()

,Student ID,name,gender,grade,school_name,reading_score,math_score,passing_reading,passing_math
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,1
1,1,Victor Smith,M,12th,Huang High School,94,61,1,0
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,1,0
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58,0,0
4,4,Bonnie Ray,F,9th,Huang High School,97,84,1,1

In [181]:
df_schoo11 = df_schools.rename(columns={'name':'school_name'})
df_schoo11.head()

   School ID            school_name      type  size   budget
0          0      Huang High School  District  2917  1910635
1          1   Figueroa High School  District  2949  1884411
2          2    Shelton High School   Charter  1761  1056600
3          3  Hernandez High School  District  4635  3022020
4          4    Griffin High School   Charter  1468   917500

In [182]:
df_merge = pd.merge(df_schoo11, df_students1, on='school_name')
df_merge.head()

,School ID,school_name,type,size,budget,Student ID,name,gender,grade,reading_score,math_score,passing_reading,passing_math
0,0,Huang High School,District,2917,1910635,0,Paul Bradley,M,9th,66,79,0,1
1,0,Huang High School,District,2917,1910635,1,Victor Smith,M,12th,94,61,1,0
2,0,Huang High School,District,2917,1910635,2,Kevin Rodriguez,M,12th,90,60,1,0
3,0,Huang High School,District,2917,1910635,3,Dr. Richard Scott,M,12th,67,58,0,0
4,0,Huang High School,District,2917,1910635,4,Bonnie Ray,F,9th,97,84,1,1

In [183]:
#Review all column names from dataframe

df_merge.columns

Index(['School ID', 'school_name', 'type', 'size', 'budget', 'Student ID',
       'name', 'gender', 'grade', 'reading_score', 'math_score',
       'passing_reading', 'passing_math'],
      dtype='object')

In [184]:
#Drop two columns from the dataframe

df_merge.drop(['Student ID', 'School ID'], axis=1, inplace=True)

In [185]:
#Review all column names from dataframe once the drop has occured

df_merge.columns

Index(['school_name', 'type', 'size', 'budget', 'name', 'gender', 'grade',
       'reading_score', 'math_score', 'passing_reading', 'passing_math'],
      dtype='object')

In [186]:
#Review resulting dataframe without the additional columns

df_merge.head()

,school_name,type,size,budget,name,gender,grade,reading_score,math_score,passing_reading,passing_math
0,Huang High School,District,2917,1910635,Paul Bradley,M,9th,66,79,0,1
1,Huang High School,District,2917,1910635,Victor Smith,M,12th,94,61,1,0
2,Huang High School,District,2917,1910635,Kevin Rodriguez,M,12th,90,60,1,0
3,Huang High School,District,2917,1910635,Dr. Richard Scott,M,12th,67,58,0,0
4,Huang High School,District,2917,1910635,Bonnie Ray,F,9th,97,84,1,1

In [187]:


agg_function = {'budget':np.mean, 'reading_score':np.mean, 'math_score': np.mean, 'size': np.mean, 'passing_reading': np.sum, 'passing_math': np.sum}

In [188]:
#Join the data frames and create a new column that determines the amount of money allocated per student

df_grouped = df_merge.groupby(df_merge['school_name'], as_index=False).agg(agg_function)
df_grouped['Per_Student_Budget'] = df_grouped['budget'] / df_grouped['size']
df_grouped['Pct_Passing_Math'] = 100 * (df_grouped['passing_math'] / df_grouped['size']) 
df_grouped['Pct_Passing_Reading'] = 100 * (df_grouped['passing_reading'] / df_grouped['size']) 
df_grouped['Pct_Passing_Overall'] = (df_grouped['Pct_Passing_Reading'] + df_grouped['Pct_Passing_Math']) / 2
df_grouped

,school_name,budget,reading_score,math_score,size,passing_reading,passing_math,Per_Student_Budget,Pct_Passing_Math,Pct_Passing_Reading,Pct_Passing_Overall
0,Bailey High School,3124928,81.033963,77.048432,4976,4077,3318,628.0,66.680064,81.933280,74.306672
1,Cabrera High School,1081356,83.975780,83.061895,1858,1803,1749,582.0,94.133477,97.039828,95.586652
2,Figueroa High School,1884411,81.158020,76.711767,2949,2381,1946,639.0,65.988471,80.739234,73.363852
3,Ford High School,1763916,80.746258,77.102592,2739,2172,1871,644.0,68.309602,79.299014,73.804308
4,Griffin High School,917500,83.816757,83.351499,1468,1426,1371,625.0,93.392371,97.138965,95.265668
5,Hernandez High School,3022020,80.934412,77.289752,4635,3748,3094,652.0,66.752967,80.862999,73.807983
6,Holden High School,248087,83.814988,83.803279,427,411,395,581.0,92.505855,96.252927,94.379391
7,Huang High School,1910635,81.182722,76.629414,2917,2372,1916,655.0,65.683922,81.316421,73.500171
8,Johnson High School,3094650,80.966394,77.072464,4761,3867,3145,650.0,66.057551,81.222432,73.639992
9,Pena High School,585858,84.044699,83.839917,962,923,910,609.0,94.594595,95.945946,95.270270
10,Rodriguez High School,2547363,80.744686,76.842711,3999,3208,2654,637.0,66.366592,80.220055,73.293323
11,Shelton High School,1056600,83.725724,83.359455,1761,1688,1653,600.0,93.867121,95.854628,94.860875
12,Thomas High School,1043130,83.848930,83.418349,1635,1591,1525,638.0,93.272171,97.308869,95.290520
13,Wilson High School,1319574,83.989488,83.274201,2283,2204,2143,578.0,93.867718,96.539641,95.203679
14,Wright High School,1049400,83.955000,83.682222,1800,1739,1680,583.0,93.333333,96.611111,94.972222

In [189]:
df_grouped.columns

Index(['school_name', 'budget', 'reading_score', 'math_score', 'size',
       'passing_reading', 'passing_math', 'Per_Student_Budget',
       'Pct_Passing_Math', 'Pct_Passing_Reading', 'Pct_Passing_Overall'],
      dtype='object')

In [190]:
df_grouped.drop(['passing_reading', 'passing_math'], axis = 1, inplace = True)
df_grouped.columns

Index(['school_name', 'budget', 'reading_score', 'math_score', 'size',
       'Per_Student_Budget', 'Pct_Passing_Math', 'Pct_Passing_Reading',
       'Pct_Passing_Overall'],
      dtype='object')

### School Summary Data Frame (Deliverable 2)

In [191]:
df_final = df_grouped.merge(df_schoo11, on='school_name', how='left')
df_final.drop(['budget_x', 'size_x', 'School ID','size_y', 'budget_y'], axis = 1, inplace=True)
df_final

,school_name,reading_score,math_score,Per_Student_Budget,Pct_Passing_Math,Pct_Passing_Reading,Pct_Passing_Overall,type
0,Bailey High School,81.033963,77.048432,628.0,66.680064,81.933280,74.306672,District
1,Cabrera High School,83.975780,83.061895,582.0,94.133477,97.039828,95.586652,Charter
2,Figueroa High School,81.158020,76.711767,639.0,65.988471,80.739234,73.363852,District
3,Ford High School,80.746258,77.102592,644.0,68.309602,79.299014,73.804308,District
4,Griffin High School,83.816757,83.351499,625.0,93.392371,97.138965,95.265668,Charter
5,Hernandez High School,80.934412,77.289752,652.0,66.752967,80.862999,73.807983,District
6,Holden High School,83.814988,83.803279,581.0,92.505855,96.252927,94.379391,Charter
7,Huang High School,81.182722,76.629414,655.0,65.683922,81.316421,73.500171,District
8,Johnson High School,80.966394,77.072464,650.0,66.057551,81.222432,73.639992,District
9,Pena High School,84.044699,83.839917,609.0,94.594595,95.945946,95.270270,Charter
10,Rodriguez High School,80.744686,76.842711,637.0,66.366592,80.220055,73.293323,District
11,Shelton High School,83.725724,83.359455,600.0,93.867121,95.854628,94.860875,Charter
12,Thomas High School,83.848930,83.418349,638.0,93.272171,97.308869,95.290520,Charter
13,Wilson High School,83.989488,83.274201,578.0,93.867718,96.539641,95.203679,Charter
14,Wright High School,83.955000,83.682222,583.0,93.333333,96.611111,94.972222,Charter

### Top Performing Schools (By Passing Rate)

Create a table that highlights the top 5 performing schools based on Overall Passing Rate. Include:

+ School Name
+ School Type
+ Total Students
+ Total School Budget
+ Per School Budget
+ Average Math Score
+ Average Reading Score
+ % Passing Math
+ % Passing Reading
+ Overall Passing Rate (Average of the above two)

### Top Performing Schools (By Passing Rate) Dataframe (Deliverable 3)

In [199]:
df_final.sort_values(by='Pct_Passing_Overall', ascending=False).head(5)

,school_name,reading_score,math_score,Per_Student_Budget,Pct_Passing_Math,Pct_Passing_Reading,Pct_Passing_Overall,type
1,Cabrera High School,83.975780,83.061895,582.0,94.133477,97.039828,95.586652,Charter
12,Thomas High School,83.848930,83.418349,638.0,93.272171,97.308869,95.290520,Charter
9,Pena High School,84.044699,83.839917,609.0,94.594595,95.945946,95.270270,Charter
4,Griffin High School,83.816757,83.351499,625.0,93.392371,97.138965,95.265668,Charter
13,Wilson High School,83.989488,83.274201,578.0,93.867718,96.539641,95.203679,Charter

### Top Performing Schools (By Passing Rate)

Create a table that highlights the bottom 5 performing schools based on Overall Passing Rate. Include all of the same metrics as above.

### Lowest Performing Schools (By Passing Rate) Dataframe (Deliverable 4)

In [202]:
df_final.sort_values(by='Pct_Passing_Overall', ascending=False).tail(5)

,school_name,reading_score,math_score,Per_Student_Budget,Pct_Passing_Math,Pct_Passing_Reading,Pct_Passing_Overall,type
3,Ford High School,80.746258,77.102592,644.0,68.309602,79.299014,73.804308,District
8,Johnson High School,80.966394,77.072464,650.0,66.057551,81.222432,73.639992,District
7,Huang High School,81.182722,76.629414,655.0,65.683922,81.316421,73.500171,District
2,Figueroa High School,81.158020,76.711767,639.0,65.988471,80.739234,73.363852,District
10,Rodriguez High School,80.744686,76.842711,637.0,66.366592,80.220055,73.293323,District

### Math Scores by Grade

Create a table that lists the average Math Score for students of each grade level (9th, 10th, 11th, 12th) at each school.

### Reading Scores by Grade

Create a table that lists the average Reading Score for students of each grade level (9th, 10th, 11th, 12th) at each school.